ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ИндивидуальныеУсловияПоставки/ЖБИ_ИндивидуальныеУсловияПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЖБИ_ИндивидуальныеУсловияПоставки</name>
  <comment>ЖБИ - Индивидуальные условия поставки</comment>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЖБИ_РасчетИндЦен</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЖБИ_ЗаявкиПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <comment>Менеджер логист</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Бизнес-регион</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>Статус</comment>
    <type>
      <types>EnumRef.ЖБИ_СтатусРасчетаСтавки</types>
    </type>
  </attributes>
  <attributes>
    <name>Сегмент</name>
    <type>
      <types>CatalogRef.СегментыПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Товары</comment>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <comment>Номенклатура поставщика</comment>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Негабаритный</name>
      <comment>Не габарит</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоставщика</name>
      <comment>Текущая цена поставщика с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <comment>% скидки</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяЦенаПоставщика</name>
      <comment>Новая цена поставщика с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поставщики</name>
    <attributes>
      <name>Партнер</name>
      <comment>Поставщик</comment>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Почта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>55</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ПартнерыСегмента/ПартнерыСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="94dc0182-a199-4a52-af04-ed95dec30b84">
  <name>ПартнерыСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="3e43a713-9c5c-4f6a-b17c-926c1ef0af85">
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="994998ea-b12e-4666-a2c7-8bd46b298b2f">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДолжностьПоВизитке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖБИ_Главный</name>
    <comment>Основная должность для переговоров</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖБИ_Должность</name>
    <comment>Должность</comment>
    <type>
      <types>CatalogRef.ЖБИ_Должности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РолиКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>РольКонтактногоЛица</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/Documents/ЖБИ_ИндивидуальныеУсловияПоставки/Forms/ФормаВыбораПоставщиков/Module.bsl
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьТаблицуПоставщиков()
	
	Запрос 			= Новый Запрос;
	Запрос.УстановитьПараметр("Сегмент", ОтборСегмент);
	Запрос.Текст	= "ВЫБРАТЬ
						|	ПартнерыСегмента.Партнер КАК Поставщик,
						|	Контрагенты.ИНН КАК ИНН,
						|	КонтактныеЛицаПартнеровПочта.Ссылка КАК КонтактноеЛицоПоставщика,
						|	КонтактныеЛицаПартнеровПочта.Представление КАК Почта, 						
						|	КонтактныеЛицаПартнеровПочта.Ссылка.ЖБИ_Главный КАК Основной
						|ИЗ
						|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
						|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
						|		ПО ПартнерыСегмента.Партнер = Контрагенты.Партнер	
						|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровПочта
						|		ПО ПартнерыСегмента.Партнер = КонтактныеЛицаПартнеровПочта.Ссылка.Владелец
						|			И КонтактныеЛицаПартнеровПочта.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
						|			И КонтактныеЛицаПартнеровПочта.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтактногоЛица)
						|ГДЕ
						|	ПартнерыСегмента.Сегмент = &Сегмент";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого НомСтр Из РезультатЗапроса Цикл
		НоваяСтр = ТаблицаПоставщиков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,НомСтр);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

#Область Отборы

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КомандаВыборПоставщиков(Команда)
	МассивВыбора = Новый Массив;
	Для Каждого НомСтр Из ТаблицаПоставщиков Цикл
		Если НЕ НомСтр.Выбор Тогда
			Продолжить;
		КонецЕсли;
		МассивВыбора.Добавить(Новый Структура("Партнер,Почта",НомСтр.Поставщик,НомСтр.Почта));	
	КонецЦикла;
	ОповеститьОВыборе(Новый Структура("ФормаВыбораПоставщиков", МассивВыбора));	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Сегмент") Тогда 
		Возврат;
	КонецЕсли;
	
	ОтборСегмент = Параметры.Сегмент;
	ЗаполнитьТаблицуПоставщиков();
	
КонецПроцедуры

#КонецОбласти
